# DataFrame

DataFrame is probably the most important and most commonly used object in pandas. A DataFrame is basically a collection of a number of Series that share common indices. A DataFrame arranges data in rows and columns in a tabular structure. For an indepth study of DataFrames see [this tutorial](https://www.datacamp.com/community/tutorials/pandas-tutorial-dataframe-python) from datacamp.

In [1]:
import pandas as pd

With the import in place, let's now define the problem we are going to solve using DataFrame.

## Problem 1

You are given the heights (in inch) and weights (in lbs) of 5 people as shown in the table below:

| Person | Height(inch) | Weight(lbs) |
|--------|--------------|-------------|
|    A   |     72       |      186    |
|    B   |     69       |      205    |
|    C   |     70       |      201    |
|    D   |     62       |      125    |
|    E   |     57       |      89     |

It is later found that the table actually misses entries for persons F and G whose heights are 65 inch and 60 inch respectively and the weight for F is 121 lbs, but data for G's weight is missing. Also, values for all the heights is found to be 5 inch less than it should have been, whereas values for all the weights is found to be 5 lbs more than it should have been. Find the correct Body Mass Index (BMI) for each person, if possible.

## Solution 1

First of all, we are going to represent the given table in Python using DataFrames. The entries, also known as data points are passed as a list of list into the data argument and the column names as a list of string into the columns argument. We create two data frames one for the height and another for the weight.

In [2]:
height_df = pd.DataFrame(data=[['A',72],['B',69],['C',70],['D',62],['E',57]], columns=['Person','Height'])
weight_df = pd.DataFrame(data=[['A',186],['B',205],['C',201],['D',125],['E',89]], columns=['Person','Weight'])

Next, we check the head of the DataFrames. Head gives us just a sample of the table by returning the first n number of rows as defined in the argument. In this case, we'll define n = 3.

In [3]:
height_df.head(n=3)

  Person  Height
0      A      72
1      B      69
2      C      70

If n is not specified as argument for the head method, the first 5 rows are returned.

In [4]:
weight_df.head()

  Person  Weight
0      A     186
1      B     205
2      C     201
3      D     125
4      E      89

Now, we have two DataFrames but actually we just wanted one to represent the given table. So, we'll join the two DataFrames using the merge method. Since both DataFrames have the common column **Person**, we'll use that to merge them into a single DataFrame.

In [5]:
height_weight_df = pd.merge(height_df,weight_df,on='Person')
height_weight_df

  Person  Height  Weight
0      A      72     186
1      B      69     205
2      C      70     201
3      D      62     125
4      E      57      89

We can use the describe method on this DataFrame to get statistical information about the mean, standard deviation, quartiles and others.

In [6]:
height_weight_df.describe()

          Height      Weight
count   5.000000    5.000000
mean   66.000000  161.200000
std     6.284903   51.577127
min    57.000000   89.000000
25%    62.000000  125.000000
50%    69.000000  186.000000
75%    70.000000  201.000000
max    72.000000  205.000000

We can also use the info method to get more details on the number of entries in each column and their data types.

In [7]:
height_weight_df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5 entries, 0 to 4
Data columns (total 3 columns):
Person    5 non-null object
Height    5 non-null int64
Weight    5 non-null int64
dtypes: int64(2), object(1)
memory usage: 160.0+ bytes

The describe method shows only the details for Height and Weight columns but not for the Person column. This is because the entries in the Person column are of type object, they are just names and it's not possible to perform statistical operations such as mean, standard deviation and quartiles on names. This is also clarified by the info method which shows that Height and Weight are of type int64 but Person is of type object.

The actual computations are to be only done for height and weight. The person column only binds the pair of values together with a common index. So, let's set the Person column as the index of this DataFrame using the set_index method. set_index takes an array of columns as the argument.

In [8]:
height_weight_df.set_index(['Person'])

        Height  Weight
Person
A           72     186
B           69     205
C           70     201
D           62     125
E           57      89

In [9]:
height_weight_df

  Person  Height  Weight
0      A      72     186
1      B      69     205
2      C      70     201
3      D      62     125
4      E      57      89

We set the Person column as the index but find that the setting was not in place. So, we set the index one more time; this time using **inplace=True**.

In [10]:
height_weight_df.set_index(['Person'],inplace=True)

In [11]:
height_weight_df

        Height  Weight
Person
A           72     186
B           69     205
C           70     201
D           62     125
E           57      89

Now if we check info method, we only find the height and weight columns.

In [12]:
height_weight_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, A to E
Data columns (total 2 columns):
Height    5 non-null int64
Weight    5 non-null int64
dtypes: int64(2)
memory usage: 120.0+ bytes

We can access individual columns of the DataFrame using the column names as follows.

In [13]:
height_weight_df['Height']

Person
A    72
B    69
C    70
D    62
E    57
Name: Height, dtype: int64

In [14]:
height_weight_df['Weight']

Person
A    186
B    205
C    201
D    125
E     89
Name: Weight, dtype: int64

Each of these is again a series which can be verified using the type method.

In [15]:
type(height_weight_df['Height'])

pandas.core.series.Series

Next, we realize that heights and weights for F and G were missing from the table. So, we create another DataFrame for the missing values.

In [16]:
missing_df = pd.DataFrame(data=[[65,121],[60]],index=['F','G'],columns=['Height','Weight'])
missing_df

   Height  Weight
F      65   121.0
G      60     NaN

Here we see that the weight for G was missing so a Not a Number value has been placed instead.

Then, we append this DataFrame to our original DataFrame.

In [17]:
updated_df = height_weight_df.append(missing_df)
updated_df

   Height  Weight
A      72   186.0
B      69   205.0
C      70   201.0
D      62   125.0
E      57    89.0
F      65   121.0
G      60     NaN

Again, we find that heights for each person was less by 5 and weights for each person was more by 5. So, let's ammend that.

In [18]:
updated_df['Height'] += 5
updated_df['Weight'] -=5
updated_df

   Height  Weight
A      77   181.0
B      74   200.0
C      75   196.0
D      67   120.0
E      62    84.0
F      70   116.0
G      65     NaN

The heights and weights for all persons have been updated correctly and can be used further to calculate the BMI. But as the weight for G is missing, it is not possible to calculate BMI for G. So, we remove the entry for G altogeher. Again, we need to specify **inplace=True** to make it premanent.

In [19]:
updated_df.dropna(inplace=True)
updated_df

   Height  Weight
A      77   181.0
B      74   200.0
C      75   196.0
D      67   120.0
E      62    84.0
F      70   116.0

Now that we have all the values correctly in place, it's time to find the Body Mass Index. The formula to calculate BMI is as follows:

\begin{equation*}
BMI = \frac{Weight(kg)}{[Height(meter)]^2}
\end{equation*}

To apply the above formula, the weights must first be converted from lbs to kg and heights from inch to meter. We know,  

\begin{equation*}
1 lb = 0.453592 kg, \\\
1 inch = 0.0254 m
\end{equation*}

In [20]:
lbs_to_kg_ratio = 0.453592
inch_to_meter_ratio = 0.0254

Using the above ratio we updated our DataFrame into the desired units.

In [21]:
updated_df['Height'] *= inch_to_meter_ratio
updated_df['Weight'] *= lbs_to_kg_ratio
updated_df

   Height     Weight
A  1.9558  82.100152
B  1.8796  90.718400
C  1.9050  88.904032
D  1.7018  54.431040
E  1.5748  38.101728
F  1.7780  52.616672

Now that we have all our data in the correct unit, we can use the above formula to calculate the BMI. We append a new column BMI to our existing DataFrame.

In [22]:
updated_df['BMI'] = updated_df['Weight']/(updated_df['Height']**2)
updated_df

   Height     Weight        BMI
A  1.9558  82.100152  21.463230
B  1.8796  90.718400  25.678196
C  1.9050  88.904032  24.498049
D  1.7018  54.431040  18.794449
E  1.5748  38.101728  15.363631
F  1.7780  52.616672  16.644083

Finally, we export this DataFrame to a csv file by setting the index label as Person. The csv file is saved in the same directory as this notebook.

In [23]:
updated_df.to_csv('BMI.csv',index_label='Person')

Next we look at a more complex problem to solve using Pandas DataFrame.

## Problem 2

We have a [dataset](https://openmv.net/info/travel-times) that contains data for trips made by a driver over a period of time. The description of the dataset reads as following:

*A driver uses an app to track GPS coordinates as he drives to work and back each day. The app collects the location and elevation data. Data for about 200 trips are summarized in this data set.*

Using the dataset, find <br/>
(a) the details for first, last and 10th entry, <br/>
(b) the details for each day, <br/>
(c) entries when total distance travelled in a day is greater than 90 but less than 100, <br/>
(d) the distance and fuel economy for a single row from (c), <br/>
(e) entries for Fridays when the average moving speed is greater than 90, <br/>
(f) entries when max speed is greater than 135 or fuel economy is less than 8, and <br/>
(g) details for the entries by day of week.

## Solution 2

First of all, we need to fetch the data from the csv file. The read_csv method takes in the filename as the argument and returns a DataFrame.

In [24]:
travel_df = pd.read_csv('travel-times.csv')

Before we begin to solve the problem, let's first get familiar with the data. To see what type of data are available in the dataset, we use the head method that returns the first 5 rows of the DataFrame.

In [25]:
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All,Comments
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,NaN,39.3,36.3,No,NaN
1,1/6/2012,08:20,Friday,GSK,51.63,130.3,81.8,88.9,NaN,37.9,34.9,No,NaN
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,NaN,37.5,35.9,No,NaN
3,1/4/2012,07:53,Wednesday,GSK,49.17,132.3,74.2,82.9,NaN,39.8,35.6,No,NaN
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,NaN,36.8,34.8,No,NaN

The head method familiarizes us with the columns available in the dataset and provides just a sample of data. Let's learn some more about the data by using the describe method.

In [26]:
travel_df.describe()

,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,TotalTime,MovingTime
count,205.000000,205.000000,205.000000,205.000000,205.000000,205.000000
mean,50.981512,127.591707,74.477561,81.975610,41.904390,37.871707
std,1.321205,4.128450,11.409816,10.111544,6.849476,4.835072
min,48.320000,112.200000,38.100000,50.300000,28.200000,27.100000
25%,50.650000,124.900000,68.900000,76.600000,38.400000,35.700000
50%,51.140000,127.400000,73.600000,81.400000,41.300000,37.600000
75%,51.630000,129.800000,79.900000,86.000000,44.400000,39.900000
max,60.320000,140.900000,107.700000,112.100000,82.300000,62.400000

The describe method lists only 6 columns from the original DataFrame. This is because only those 6 are of numeric type and hence their mean, standard deviation, quartile, etc. can be computed. Let's verify this further with the info method.

In [27]:
travel_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 13 columns):
Date              205 non-null object
StartTime         205 non-null object
DayOfWeek         205 non-null object
GoingTo           205 non-null object
Distance          205 non-null float64
MaxSpeed          205 non-null float64
AvgSpeed          205 non-null float64
AvgMovingSpeed    205 non-null float64
FuelEconomy       188 non-null object
TotalTime         205 non-null float64
MovingTime        205 non-null float64
Take407All        205 non-null object
Comments          24 non-null object
dtypes: float64(6), object(7)
memory usage: 20.9+ KB

Indeed only the 6 columns are of type float64. However, we find some interesting information from the info method. There are 13 columns and 11 of them have 205 entries but FuelEconomy has only 188 whereas Comments field has only 24. That is very less data comparatively and doesn't provide us with much information. Morever, our problem doesn't define anything about Comments. Since, we're not interested with Comments, we'll drop this column altogether. Remember that we need to state **inplace=True** in order to drop the column permanently.

In [28]:
travel_df.drop(labels=['Comments'],axis=1,inplace=True)

By default, axis=0, which means dropping the index. To drop a column, we explicitly define axis=1. Again, we check the head and info methods.

In [29]:
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,NaN,39.3,36.3,No
1,1/6/2012,08:20,Friday,GSK,51.63,130.3,81.8,88.9,NaN,37.9,34.9,No
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,NaN,37.5,35.9,No
3,1/4/2012,07:53,Wednesday,GSK,49.17,132.3,74.2,82.9,NaN,39.8,35.6,No
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,NaN,36.8,34.8,No

In [30]:
travel_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 12 columns):
Date              205 non-null object
StartTime         205 non-null object
DayOfWeek         205 non-null object
GoingTo           205 non-null object
Distance          205 non-null float64
MaxSpeed          205 non-null float64
AvgSpeed          205 non-null float64
AvgMovingSpeed    205 non-null float64
FuelEconomy       188 non-null object
TotalTime         205 non-null float64
MovingTime        205 non-null float64
Take407All        205 non-null object
dtypes: float64(6), object(6)
memory usage: 19.3+ KB

Now, we're left with only 12 columns. Still we have missing data in the FuelEconomy field; something we are interested in. Let's look at a bigger sample so that we can look at rows where FuelEconomy is not NaN.

In [31]:
travel_df.head(n=10)

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,NaN,39.3,36.3,No
1,1/6/2012,08:20,Friday,GSK,51.63,130.3,81.8,88.9,NaN,37.9,34.9,No
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,NaN,37.5,35.9,No
3,1/4/2012,07:53,Wednesday,GSK,49.17,132.3,74.2,82.9,NaN,39.8,35.6,No
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,NaN,36.8,34.8,No
5,1/3/2012,07:57,Tuesday,GSK,51.80,135.8,84.5,88.8,NaN,36.8,35.0,No
6,1/2/2012,17:31,Monday,Home,51.37,123.2,82.9,87.3,-,37.2,35.3,No
7,1/2/2012,07:34,Monday,GSK,49.01,128.3,77.5,85.9,-,37.9,34.3,No
8,12/23/2011,08:01,Friday,GSK,52.91,130.3,80.9,88.3,8.89,39.3,36.0,No
9,12/22/2011,17:19,Thursday,Home,51.17,122.3,70.6,78.1,8.89,43.5,39.3,No

We see that the FuelEconomy field contains numbers but the info method showed the data type as object. Let's verify this further with the dtype attribute.

In [32]:
travel_df['FuelEconomy'].dtype

dtype('O')

The 'O' represents that it is of type object. By looking at the head above, we can see that it not only contains NaNs but also dashed (-) entries, which is of type object. Before performing any operation, we need to convert the FuelEconomy field to numeric type. To do this, we use the to_numeric method.

In [33]:
travel_df['FuelEconomy'] = pd.to_numeric(travel_df['FuelEconomy'],errors='coerce')

to_numeric method tries to parse a string to a number. **errors='coerce'** causes the entries that cannot be parsed into a number to be set to NaN. If errors is not explicitly defined, the default result will be to throw an exception as the dashed (-) entries cannot be parsed to a number.

Now, let us again look at the info and head methods.

In [34]:
travel_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 12 columns):
Date              205 non-null object
StartTime         205 non-null object
DayOfWeek         205 non-null object
GoingTo           205 non-null object
Distance          205 non-null float64
MaxSpeed          205 non-null float64
AvgSpeed          205 non-null float64
AvgMovingSpeed    205 non-null float64
FuelEconomy       186 non-null float64
TotalTime         205 non-null float64
MovingTime        205 non-null float64
Take407All        205 non-null object
dtypes: float64(7), object(5)
memory usage: 19.3+ KB

In [35]:
travel_df.head(n=10)

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,NaN,39.3,36.3,No
1,1/6/2012,08:20,Friday,GSK,51.63,130.3,81.8,88.9,NaN,37.9,34.9,No
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,NaN,37.5,35.9,No
3,1/4/2012,07:53,Wednesday,GSK,49.17,132.3,74.2,82.9,NaN,39.8,35.6,No
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,NaN,36.8,34.8,No
5,1/3/2012,07:57,Tuesday,GSK,51.80,135.8,84.5,88.8,NaN,36.8,35.0,No
6,1/2/2012,17:31,Monday,Home,51.37,123.2,82.9,87.3,NaN,37.2,35.3,No
7,1/2/2012,07:34,Monday,GSK,49.01,128.3,77.5,85.9,NaN,37.9,34.3,No
8,12/23/2011,08:01,Friday,GSK,52.91,130.3,80.9,88.3,8.89,39.3,36.0,No
9,12/22/2011,17:19,Thursday,Home,51.17,122.3,70.6,78.1,8.89,43.5,39.3,No

The datatype for FuelEconomy has now been changed to float64 and there are now 186 non-null entries because the dashed entries have been set to NaN.

It is desirable that the numeric values are all filled in order to perform further computations. One common way to remove the NaN values is to fill these entries with the mean of the available values in the column. To do this, we use the fillna method with inplace=True.

In [36]:
travel_df['FuelEconomy'].fillna(travel_df['FuelEconomy'].mean(),inplace=True)

In [37]:
travel_df.head()

,Date,StartTime,DayOfWeek,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All
0,1/6/2012,16:37,Friday,Home,51.29,127.4,78.3,84.8,8.690591,39.3,36.3,No
1,1/6/2012,08:20,Friday,GSK,51.63,130.3,81.8,88.9,8.690591,37.9,34.9,No
2,1/4/2012,16:17,Wednesday,Home,51.27,127.4,82.0,85.8,8.690591,37.5,35.9,No
3,1/4/2012,07:53,Wednesday,GSK,49.17,132.3,74.2,82.9,8.690591,39.8,35.6,No
4,1/3/2012,18:57,Tuesday,Home,51.15,136.2,83.4,88.1,8.690591,36.8,34.8,No

In [38]:
travel_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 205 entries, 0 to 204
Data columns (total 12 columns):
Date              205 non-null object
StartTime         205 non-null object
DayOfWeek         205 non-null object
GoingTo           205 non-null object
Distance          205 non-null float64
MaxSpeed          205 non-null float64
AvgSpeed          205 non-null float64
AvgMovingSpeed    205 non-null float64
FuelEconomy       205 non-null float64
TotalTime         205 non-null float64
MovingTime        205 non-null float64
Take407All        205 non-null object
dtypes: float64(7), object(5)
memory usage: 19.3+ KB

We now have all 205 values in the FuelEconomy column filled with mean values wherever the data was missing.

Now we are ready to begin solving the problems given above. For the first problem, we use the iloc attribute to find the first, last and 10th entry in the DataFrame.

In [39]:
travel_df.iloc[0]

Date              1/6/2012
StartTime            16:37
DayOfWeek           Friday
GoingTo               Home
Distance             51.29
MaxSpeed             127.4
AvgSpeed              78.3
AvgMovingSpeed        84.8
FuelEconomy        8.69059
TotalTime             39.3
MovingTime            36.3
Take407All              No
Name: 0, dtype: object

In [40]:
travel_df.iloc[-1]

Date              7/11/2011
StartTime             16:56
DayOfWeek            Monday
GoingTo                Home
Distance              51.73
MaxSpeed                125
AvgSpeed               62.8
AvgMovingSpeed         92.5
FuelEconomy         8.69059
TotalTime              49.5
MovingTime             33.6
Take407All              Yes
Name: 204, dtype: object

In [41]:
travel_df.iloc[9]

Date              12/22/2011
StartTime              17:19
DayOfWeek           Thursday
GoingTo                 Home
Distance               51.17
MaxSpeed               122.3
AvgSpeed                70.6
AvgMovingSpeed          78.1
FuelEconomy             8.89
TotalTime               43.5
MovingTime              39.3
Take407All                No
Name: 9, dtype: object

Next, we see that there are multiple entries for a single date. So, let's group the data so that there is only a single entry for every date. We attempt to group our DataFrame by the Date column.

In [42]:
travel_df_by_date = travel_df.groupby(['Date'])

In [43]:
type(travel_df_by_date)

pandas.core.groupby.DataFrameGroupBy

We use the type method to see that the result of groupby results in a DataFrameGroupBy instance.

Now, to combine multiple rows with the same Date, we use the sum method on the DataFrameGroupBy instance.

In [44]:
travel_df_by_date_combined = travel_df_by_date.sum()
travel_df_by_date_combined.head()

,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
Date,,,,,,,
1/2/2012,100.38,251.5,160.4,173.2,17.381183,75.1,69.6
1/3/2012,102.95,272.0,167.9,176.9,17.381183,73.6,69.8
1/4/2012,100.44,259.7,156.2,168.7,17.381183,77.3,71.5
1/6/2012,102.92,257.7,160.1,173.7,17.381183,77.2,71.2
10/11/2011,100.46,265.9,153.0,171.6,15.620000,80.3,71.0

Looking at our problem, we also need the DayOfWeek column. But using the sum method only retains the numeric fields. So, to get the DayOfWeek column as well, we group by Date and DayOfWeek columns.

In [45]:
travel_df_by_date = travel_df.groupby(['Date','DayOfWeek'])
travel_df_by_date_combined = travel_df_by_date.sum()

In [46]:
travel_df_by_date_combined.head()

,,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
Date,DayOfWeek,,,,,,,
1/2/2012,Monday,100.38,251.5,160.4,173.2,17.381183,75.1,69.6
1/3/2012,Tuesday,102.95,272.0,167.9,176.9,17.381183,73.6,69.8
1/4/2012,Wednesday,100.44,259.7,156.2,168.7,17.381183,77.3,71.5
1/6/2012,Friday,102.92,257.7,160.1,173.7,17.381183,77.2,71.2
10/11/2011,Tuesday,100.46,265.9,153.0,171.6,15.620000,80.3,71.0

But we can now see that DataFrame now has some incorrect data. It is correct for the columns Distance, TotalTime and MovingTime to have the sum when grouped by date. But by using the sum method, we have also added the MaxSpeed, AvgSpeed, AvgMovingSpeed and FuelEconomy columns, which is incorrect. MaxSpeed should contain the max value for the rows of the particular date, and the other columns should contain the mean of the rows. So, let's ammend that.

In [47]:
travel_df_by_date_combined['MaxSpeed'] = travel_df_by_date['MaxSpeed'].max()
travel_df_by_date_combined['AvgSpeed'] = travel_df_by_date['AvgSpeed'].mean()
travel_df_by_date_combined['AvgMovingSpeed'] = travel_df_by_date['AvgMovingSpeed'].mean()
travel_df_by_date_combined['FuelEconomy'] = travel_df_by_date['FuelEconomy'].mean()

In [48]:
travel_df_by_date_combined.head()

,,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
Date,DayOfWeek,,,,,,,
1/2/2012,Monday,100.38,128.3,80.20,86.60,8.690591,75.1,69.6
1/3/2012,Tuesday,102.95,136.2,83.95,88.45,8.690591,73.6,69.8
1/4/2012,Wednesday,100.44,132.3,78.10,84.35,8.690591,77.3,71.5
1/6/2012,Friday,102.92,130.3,80.05,86.85,8.690591,77.2,71.2
10/11/2011,Tuesday,100.46,135.1,76.50,85.80,7.810000,80.3,71.0

Now, we can see that the DataFrame has correct data.

In [49]:
travel_df_by_date_combined.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 111 entries, (1/2/2012, Monday) to (9/8/2011, Thursday)
Data columns (total 7 columns):
Distance          111 non-null float64
MaxSpeed          111 non-null float64
AvgSpeed          111 non-null float64
AvgMovingSpeed    111 non-null float64
FuelEconomy       111 non-null float64
TotalTime         111 non-null float64
MovingTime        111 non-null float64
dtypes: float64(7)
memory usage: 7.4+ KB

Grouping by Date and DayOfWeek columns has resulting in a MultiIndex dataframe as can be seen from the head and info methods. But we want DayOfWeek to be a regular column instead of an index. So, we first reset the index so that the index of the DataFrame becomes plain integers. In the next step, we set the Date column back as the index.

In [50]:
travel_df_by_date_combined.reset_index(inplace=True)

This time we use the tail method to see the last 5 rows and see that both Date and DayOfWeek are set back as regular columns.

In [51]:
travel_df_by_date_combined.tail()

,Date,DayOfWeek,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
106,9/28/2011,Wednesday,101.88,128.8,90.70,93.60,8.93,68.5,66.4
107,9/29/2011,Thursday,102.04,128.4,74.40,79.40,8.93,83.6,77.9
108,9/6/2011,Tuesday,107.24,132.5,95.25,98.15,8.50,67.6,65.6
109,9/7/2011,Wednesday,100.42,132.8,64.00,71.55,8.50,95.2,84.5
110,9/8/2011,Thursday,100.17,137.0,60.20,70.40,8.50,100.8,86.2

In [52]:
travel_df_by_date_combined.set_index(['Date'],inplace=True)

In [53]:
travel_df_by_date_combined.head()

,DayOfWeek,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
Date,,,,,,,,
1/2/2012,Monday,100.38,128.3,80.20,86.60,8.690591,75.1,69.6
1/3/2012,Tuesday,102.95,136.2,83.95,88.45,8.690591,73.6,69.8
1/4/2012,Wednesday,100.44,132.3,78.10,84.35,8.690591,77.3,71.5
1/6/2012,Friday,102.92,130.3,80.05,86.85,8.690591,77.2,71.2
10/11/2011,Tuesday,100.46,135.1,76.50,85.80,7.810000,80.3,71.0

Finally, we have the Date column back as the index. And there is a single entry for each date.

Now, let's find the entries where the distance is greater than 90 but less than 100. For this we use conditional selection.

In [54]:
distance_above_ninety = travel_df_by_date_combined['Distance']>90
distance_above_ninety

Date
1/2/2012       True
1/3/2012       True
1/4/2012       True
1/6/2012       True
10/11/2011     True
10/12/2011     True
10/13/2011    False
10/17/2011     True
10/18/2011     True
10/19/2011     True
10/20/2011     True
10/21/2011    False
10/24/2011    False
10/25/2011     True
10/26/2011    False
10/27/2011    False
10/28/2011    False
10/3/2011      True
10/31/2011     True
10/4/2011      True
10/5/2011      True
10/6/2011      True
10/7/2011      True
11/1/2011     False
11/10/2011     True
11/14/2011     True
11/15/2011     True
11/16/2011     True
11/17/2011     True
11/2/2011      True
              ...
8/22/2011      True
8/23/2011      True
8/24/2011      True
8/25/2011      True
8/26/2011      True
8/29/2011      True
8/3/2011       True
8/30/2011      True
8/31/2011      True
8/4/2011       True
8/5/2011       True
8/8/2011       True
8/9/2011       True
9/1/2011       True
9/12/2011      True
9/13/2011      True
9/14/2011      True
9/15/2011      True
9/19/2011      True
9/2/2011       True
9/20/2011      True
9/21/2011      True
9/22/2011      True
9/26/2011      True
9/27/2011      True
9/28/2011      True
9/29/2011      True
9/6/2011       True
9/7/2011       True
9/8/2011       True
Name: Distance, Length: 111, dtype: bool

In [55]:
distance_below_hundred = travel_df_by_date_combined['Distance']<100
distance_below_hundred

Date
1/2/2012      False
1/3/2012      False
1/4/2012      False
1/6/2012      False
10/11/2011    False
10/12/2011    False
10/13/2011     True
10/17/2011    False
10/18/2011    False
10/19/2011    False
10/20/2011    False
10/21/2011     True
10/24/2011     True
10/25/2011    False
10/26/2011     True
10/27/2011     True
10/28/2011     True
10/3/2011     False
10/31/2011    False
10/4/2011     False
10/5/2011     False
10/6/2011     False
10/7/2011     False
11/1/2011      True
11/10/2011    False
11/14/2011    False
11/15/2011    False
11/16/2011    False
11/17/2011    False
11/2/2011     False
              ...
8/22/2011     False
8/23/2011     False
8/24/2011     False
8/25/2011     False
8/26/2011      True
8/29/2011     False
8/3/2011      False
8/30/2011     False
8/31/2011     False
8/4/2011      False
8/5/2011      False
8/8/2011      False
8/9/2011      False
9/1/2011      False
9/12/2011     False
9/13/2011     False
9/14/2011     False
9/15/2011     False
9/19/2011     False
9/2/2011      False
9/20/2011     False
9/21/2011     False
9/22/2011     False
9/26/2011     False
9/27/2011     False
9/28/2011     False
9/29/2011     False
9/6/2011      False
9/7/2011      False
9/8/2011      False
Name: Distance, Length: 111, dtype: bool

We can see that distance_above_ninety and distance_below_hundred both return a Series with Date as the index and True/False as the values corresponding to whether the conditions have been met.

We cannot use the *and* operator to combine distance_above_ninety and distance_below_hundred as we normally would in Python. This is because the *and* operator only works on two boolean values, but here we are dealing with two Series of boolean values. Using the *and* operator would result in **ValueError: The truth value of a Series is ambiguous**.
Instead to find a combined series of truth values, we need to use the *&* operator

In [56]:
distance_above_ninety & distance_below_hundred

Date
1/2/2012      False
1/3/2012      False
1/4/2012      False
1/6/2012      False
10/11/2011    False
10/12/2011    False
10/13/2011    False
10/17/2011    False
10/18/2011    False
10/19/2011    False
10/20/2011    False
10/21/2011    False
10/24/2011    False
10/25/2011    False
10/26/2011    False
10/27/2011    False
10/28/2011    False
10/3/2011     False
10/31/2011    False
10/4/2011     False
10/5/2011     False
10/6/2011     False
10/7/2011     False
11/1/2011     False
11/10/2011    False
11/14/2011    False
11/15/2011    False
11/16/2011    False
11/17/2011    False
11/2/2011     False
              ...
8/22/2011     False
8/23/2011     False
8/24/2011     False
8/25/2011     False
8/26/2011      True
8/29/2011     False
8/3/2011      False
8/30/2011     False
8/31/2011     False
8/4/2011      False
8/5/2011      False
8/8/2011      False
8/9/2011      False
9/1/2011      False
9/12/2011     False
9/13/2011     False
9/14/2011     False
9/15/2011     False
9/19/2011     False
9/2/2011      False
9/20/2011     False
9/21/2011     False
9/22/2011     False
9/26/2011     False
9/27/2011     False
9/28/2011     False
9/29/2011     False
9/6/2011      False
9/7/2011      False
9/8/2011      False
Name: Distance, Length: 111, dtype: bool

Finally, we use the combined conditional selection on the DataFrame to find entries where distance is greater than 90 but less than 100.

In [57]:
ninety_to_hundred_df = travel_df_by_date_combined[distance_above_ninety & distance_below_hundred]
ninety_to_hundred_df

,DayOfWeek,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
Date,,,,,,,,
7/25/2011,Monday,99.37,126.6,66.90,78.60,8.45,96.8,75.9
7/27/2011,Wednesday,99.80,124.9,69.35,74.85,8.45,86.4,80.2
7/29/2011,Friday,99.75,135.6,90.45,94.05,8.45,68.4,65.5
8/26/2011,Friday,99.89,132.7,78.70,85.10,8.54,76.2,70.5

We can now extract a part of this DataFrame using the loc attribute. Let's get the Distance and FuelEconomy for the last date.

In [58]:
ninety_to_hundred_df.loc[['8/26/2011'],['Distance','FuelEconomy']]

           Distance  FuelEconomy
Date
8/26/2011     99.89         8.54

Again, we use the combined conditional selection to find entries where the average moving speed is above 90 on a Friday.

In [59]:
over_ninety_on_friday = travel_df_by_date_combined[(travel_df_by_date_combined['AvgMovingSpeed']>90) & (travel_df_by_date_combined['DayOfWeek']=='Friday')]
over_ninety_on_friday

,DayOfWeek,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
Date,,,,,,,,
10/21/2011,Friday,50.64,129.0,106.60,112.10,8.97,28.5,27.1
10/7/2011,Friday,101.70,128.3,91.15,98.05,7.97,68.0,62.8
7/29/2011,Friday,99.75,135.6,90.45,94.05,8.45,68.4,65.5

And we do the same for entries where either the max speed is greater than 135 or the fuel economy is less than 8. Like in case of the *and* operator, we cannot use *or* operator for the same reason. Instead we use the pipe(|) operator.

In [60]:
max_speed_over_one_thirty_five_or_fuel_economy_below_eight = travel_df_by_date_combined[(travel_df_by_date_combined['MaxSpeed']>135) | (travel_df_by_date_combined['FuelEconomy']<8)]
max_speed_over_one_thirty_five_or_fuel_economy_below_eight

,DayOfWeek,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
Date,,,,,,,,
1/3/2012,Tuesday,102.95,136.2,83.95,88.45,8.690591,73.6,69.8
10/11/2011,Tuesday,100.46,135.1,76.50,85.80,7.810000,80.3,71.0
10/17/2011,Monday,101.91,137.1,86.15,91.60,8.750000,71.5,67.4
10/3/2011,Monday,101.87,127.4,86.15,90.80,7.970000,71.2,67.5
10/4/2011,Tuesday,101.82,128.8,85.45,91.55,7.970000,72.4,67.1
10/5/2011,Wednesday,101.90,128.5,86.45,91.75,7.970000,73.7,68.9
10/6/2011,Thursday,101.92,126.0,55.90,90.05,7.970000,72.8,69.6
10/7/2011,Friday,101.70,128.3,91.15,98.05,7.970000,68.0,62.8
12/19/2011,Monday,103.04,137.8,77.00,85.65,8.890000,80.3,72.2
7/14/2011,Thursday,50.90,123.7,76.20,95.10,7.890000,40.1,32.1
7/18/2011,Monday,54.52,125.6,49.90,82.40,7.890000,65.5,39.7
7/19/2011,Tuesday,102.12,126.7,87.25,99.50,7.890000,70.5,61.6
7/20/2011,Wednesday,101.97,125.8,67.15,79.15,7.890000,93.3,78.5
7/29/2011,Friday,99.75,135.6,90.45,94.05,8.450000,68.4,65.5
8/18/2011,Thursday,103.23,137.7,58.90,70.15,8.370000,107.1,89.1
8/30/2011,Tuesday,100.70,138.0,68.10,75.50,8.500000,88.8,80.2
8/31/2011,Wednesday,100.22,140.9,68.70,78.40,8.500000,87.6,76.7
9/8/2011,Thursday,100.17,137.0,60.20,70.40,8.500000,100.8,86.2

Finally, we look at some statistical information by day of the week. The sum method applied on the DataFrameGroupBy instance provides the sum of each column along the individual day rows.

In [61]:
travel_df.groupby(['DayOfWeek']).sum()

,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime
DayOfWeek,,,,,,,
Friday,1375.89,3444.1,2204.8,2374.3,234.201183,1023.9,948.1
Monday,1981.04,4953.7,2854.7,3174.8,340.032957,1684.7,1487.7
Thursday,2239.72,5631.4,3272.1,3643.6,384.471183,1811.8,1646.4
Tuesday,2454.12,6155.3,3541.5,3882.9,414.212957,2041.0,1844.5
Wednesday,2400.44,5971.8,3394.8,3729.4,408.652957,2029.0,1837.0

Likewise, we can find the max values for each column along the individual day rows. The max method also works for non-numeric columns.

In [62]:
travel_df.groupby(['DayOfWeek']).max()

,Date,StartTime,GoingTo,Distance,MaxSpeed,AvgSpeed,AvgMovingSpeed,FuelEconomy,TotalTime,MovingTime,Take407All
DayOfWeek,,,,,,,,,,,
Friday,9/2/2011,20:31,Home,55.57,135.6,107.7,112.1,9.76,47.9,43.2,Yes
Monday,9/26/2011,17:38,Home,54.52,137.8,104.4,106.2,10.05,82.3,62.4,Yes
Thursday,9/8/2011,17:58,Home,52.42,137.7,106.8,111.3,10.05,61.2,48.9,Yes
Tuesday,9/6/2011,18:57,Home,54.36,138.0,95.4,102.6,9.53,70.5,59.8,Yes
Wednesday,9/7/2011,18:05,Home,60.32,140.9,103.4,108.0,9.76,54.8,48.5,Yes

It is also possible to use the describe method to get all details such as mean, standard deviation, quartiles, etc. at once. Below we use describe method on one of the columns.

In [63]:
travel_df.groupby(['DayOfWeek'])['AvgMovingSpeed'].describe()

           count       mean        std   min    25%    50%    75%    max
DayOfWeek
Friday      27.0  87.937037   9.288792  77.1  81.70  86.90  89.95  112.1
Monday      39.0  81.405128  10.600297  50.3  75.60  82.40  85.80  106.2
Thursday    44.0  82.809091  10.534082  63.1  77.05  80.85  85.55  111.3
Tuesday     48.0  80.893750   9.921338  51.5  75.55  81.05  85.65  102.6
Wednesday   47.0  79.348936   8.801207  65.8  74.10  78.70  81.75  108.0